In [223]:
import pandas as pd

In [224]:
url='http://bit.ly/drinksbycountry'

In [225]:
drinks=pd.read_csv(url)

In [226]:
drinks.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [227]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [228]:
drinks.beer_servings.astype(float).head()

0      0.0
1     89.0
2     25.0
3    245.0
4    217.0
Name: beer_servings, dtype: float64

In [229]:
drinks.columns=drinks.columns.str.replace('_','-',)

In [230]:
drinks.columns

Index(['country', 'beer-servings', 'spirit-servings', 'wine-servings',
       'total-litres-of-pure-alcohol', 'continent'],
      dtype='object')

In [231]:
drinks.columns=drinks.columns.str.lower()

In [232]:
drinks['country']=drinks.country.str.lower()

In [233]:
drinks.head()

,country,beer-servings,spirit-servings,wine-servings,total-litres-of-pure-alcohol,continent
0,afghanistan,0,0,0,0.0,Asia
1,albania,89,132,54,4.9,Europe
2,algeria,25,0,14,0.7,Africa
3,andorra,245,138,312,12.4,Europe
4,angola,217,57,45,5.9,Africa

In [234]:
drinks['+sign']='+'

In [235]:
drinks.head()

,country,beer-servings,spirit-servings,wine-servings,total-litres-of-pure-alcohol,continent,+sign
0,afghanistan,0,0,0,0.0,Asia,+
1,albania,89,132,54,4.9,Europe,+
2,algeria,25,0,14,0.7,Africa,+
3,andorra,245,138,312,12.4,Europe,+
4,angola,217,57,45,5.9,Africa,+

In [236]:
drinks['country']=(drinks['+sign'] + ' '+ drinks['country'])

In [237]:
drinks.shape

(193, 7)

In [238]:
drinks.head()

,country,beer-servings,spirit-servings,wine-servings,total-litres-of-pure-alcohol,continent,+sign
0,+ afghanistan,0,0,0,0.0,Asia,+
1,+ albania,89,132,54,4.9,Europe,+
2,+ algeria,25,0,14,0.7,Africa,+
3,+ andorra,245,138,312,12.4,Europe,+
4,+ angola,217,57,45,5.9,Africa,+

In [239]:
drinks['country']=drinks.country.str.replace('+','')

In [240]:
drinks.head()

,country,beer-servings,spirit-servings,wine-servings,total-litres-of-pure-alcohol,continent,+sign
0,afghanistan,0,0,0,0.0,Asia,+
1,albania,89,132,54,4.9,Europe,+
2,algeria,25,0,14,0.7,Africa,+
3,andorra,245,138,312,12.4,Europe,+
4,angola,217,57,45,5.9,Africa,+

In [241]:
drinks['country']=drinks.country.str.upper()

In [242]:
drinks.head()

,country,beer-servings,spirit-servings,wine-servings,total-litres-of-pure-alcohol,continent,+sign
0,AFGHANISTAN,0,0,0,0.0,Asia,+
1,ALBANIA,89,132,54,4.9,Europe,+
2,ALGERIA,25,0,14,0.7,Africa,+
3,ANDORRA,245,138,312,12.4,Europe,+
4,ANGOLA,217,57,45,5.9,Africa,+

In [243]:
drinks['continent-length']=drinks.continent.apply(len)

In [244]:
drinks['total-alcohol']=drinks['total-litres-of-pure-alcohol'].apply(int)

In [245]:
drinks.head()

,country,beer-servings,spirit-servings,wine-servings,total-litres-of-pure-alcohol,continent,+sign,continent-length,total-alcohol
0,AFGHANISTAN,0,0,0,0.0,Asia,+,4,0
1,ALBANIA,89,132,54,4.9,Europe,+,6,4
2,ALGERIA,25,0,14,0.7,Africa,+,6,0
3,ANDORRA,245,138,312,12.4,Europe,+,6,12
4,ANGOLA,217,57,45,5.9,Africa,+,6,5

#### LAMBDA FUNCTION (EXPRESSION)

In [254]:
#drinks['beer-servings'].map(lambda x: x+1)

In [269]:
#Map function
drinks['xxcontinent']=drinks.continent.map(lambda x: 'xx_' + x)

In [270]:
#string replace function
drinks['minusXX']=drinks.xxcontinent.map(lambda x: x.replace('xx_',''))